{
  "screen-in": {
    "name": "Screen-In",
    "messages": [
      "Full Stack Engineer, 2014 - 2015",
      "Development of a multi-tenant web app to manage teams and tasks, with time tracking, collaboration and reporting.",
      "Development of an integration service (desktop), connecting commercial POS and ERP softwares.",
      "Skills: Laravel · jQuery · VB.NET · MySQL · MSSQL"
    ]
  },
  "ideias-dinamicas": {
    "name": "Ideias Dinâmicas",
    "messages": [
      "Full Stack Engineer, 2015 - 2019",
      "Development of multiple projects (software house) in multiple languages / frameworks.",
      "Played an important role in defining and consolidating what became the main tech stack and architecture used in new apps.",
      "Led a small team in one of the company's biggest projects (at the time).",
      "Skills: Vue.js · .NET Core · PostgreSQL · MSSQL · Laravel"
    ]
  },
  "knok": {
    "name": "Knok Healthcare",
    "messages": [
      "Senior Front-end Engineer, 2019 - 2023",
      "Developed the company's main product, shaping front-end technical solutions within a multidisciplinary team.",
      "Built shared components, integrated Vonage Video API, payment gateways, real-time communication and RTL support.",
      "Tech stack maintenance, including Vue 2 → Vue 3 migration.",
      "DX improvements with custom tooling.",
      "Skills: Vue.js · TypeScript · JavaScript · CI · Storybook · GitHub Actions"
    ]
  },
  "kenbi": {
    "name": "Kenbi",
    "messages": [
      "Lead Front-end Engineer, 2023 - 2025",
      "Led front-end development for management tools supporting elderly care operations.",
      "Helped migrating the platform to a new app with a TailwindCSS-based design system.",
      "Built shared components, dashboards (Chart.js), route planning maps (OpenLayers) and feedback tracking (Refiner).",
      "Improved code quality by implementing SOLID principles, tests and clear documentation.",
      "Conducted technical interviews, onboarded and mentored new developers.",
      "Skills: Vue.js · JavaScript . TailwindCSS"
    ]
  }
}
