{
  "screen-in": {
    "name": "Screen-In",
    "messages": [
      "Full Stack Engineer, 2014 - 2015",
      "Development of a multi-tenant web app to manage teams and tasks, with time tracking, collaboration and reporting.",
      "Development of an integration service (desktop), connecting commercial POS and ERP softwares.",
      "Skills: Laravel · jQuery · VB.NET · MySQL · MSSQL"
    ]
  },
  "ideias-dinamicas": {
    "name": "Ideias Dinâmicas",
    "messages": [
      "Full Stack Engineer, 2015 - 2019",
      "Development of multiple projects (software house) in multiple languages / frameworks.",
      "Played an important role in defining and consolidating what became the main tech stack and architecture used in new apps.",
      "Led a small team in one of the company's biggest projects (at the time).",
      "Skills: Vue.js · .NET Core · PostgreSQL · MSSQL · Laravel"
    ]
  },
  "knok": {
    "name": "Knok Healthcare",
    "messages": [
      "Senior Front-end Engineer, 2019 - 2023",
      "Front-end development of the company's main product, playing an important role in defining technical solutions for the front-end, within a multidisciplinary team.",
      "Extensive integration of Vonage Video API, payment gateways and flows, real-time communication, RTL support",
      "Tech stack maintenance, including Vue 2 → Vue 3 migration",
      "DX improvements with custom tooling",
      "Skills: Vue.js · TypeScript · JavaScript · CI · Storybook · GitHub Actions"
    ]
  },
  "kenbi": {
    "name": "Kenbi",
    "messages": [
      "Lead Front-end Engineer, 2023 - 2025",
      "Led front-end efforts for internal management tools supporting elderly care operations in Germany.",
      "Designed and implemented scalable front-end solutions, collaborating closely with back-end engineers and stakeholders.",
      "Contributed in modernizing the platform by migrating from a legacy system to a newly built app featuring a custom TailwindCSS-based design system.",
      "Developed data-driven features such as interactive dashboards (Chart.js), route planning maps (OpenLayers), and customer feedback tracking (Refiner).",
      "Advocated and implemented best practices, including SOLID principles, comprehensive testing, and well-structured documentation to enhance maintainability and team efficiency.",
      "Strengthened the team by conducting technical interviews, onboarding new members, and mentoring developers to ensure seamless knowledge transfer.",
      "Skills: Vue.js · JavaScript . TailwindCSS"
    ]
  }
}
